espressif/esp-eth-drivers/common_examples/simple-ethernet/sdkconfig.ci.alternate_esp32p4
CONFIG_IDF_TARGET="esp32p4"

CONFIG_ETHERNET_INTERNAL_SUPPORT=y
CONFIG_ETHERNET_SPI_SUPPORT=n

CONFIG_ETHERNET_PHY_GENERIC=y

CONFIG_ETHERNET_PHY_INTERFACE_RMII=y
# CONFIG_ETHERNET_RMII_CLK_INPUT is not set
CONFIG_ETHERNET_RMII_CLK_OUTPUT=y
CONFIG_ETHERNET_RMII_CLK_GPIO=23
CONFIG_ETHERNET_RMII_CLK_EXT_LOOPBACK_EN=y

CONFIG_ETHERNET_PHY_RST_TIMING_EN=y

CONFIG_ETHERNET_DEFAULT_EVENT_HANDLER=n

CONFIG_ETHERNET_RX_TASK_STACK_SIZE=4096
CONFIG_ETHERNET_RX_TASK_PRIO=5
